fn main() {
    let r;          // ---------+-- 'a
                          //          |
    {                     //          |
        let x = 5;   // -+-- 'b  | 
        r = &x;           //  |       |
    }                     // -+       |
                          //          |
    println!("r: {}", r); //          |
}                         // ---------+

/*  x的生命周期是 ‘b  
 *  r的生命周期是 ’a
 *  r的生命周期>x生命周期，第六行中r指向了x的生命周期
 *  也就是说 r变量指向的内存生命周期比本身小，系统判断引用的生命周期
 *  后编译器会编译报错
 *  生命周期的条件：
 *     变量的生命周期应该改 小于等于 所指向的内存的生命周期 
*/ 